<!--
title: Quick Tip #16: Explosive combinatorials
link: http://www.learningraku.com/2016/12/01/quick-tip-16-explosive-combinatorials/
author: brian
post_id: 165
date: 2016-12-01 15:27:33
post_name: quick-tip-16-explosive-combinatorials
status: publish
type: post
categories: cross-operators
tags: 
-->


Perl 6 has several sophisticated ways to make lists. I was playing with a particular task where I needed combinations for something similar to bin packing.

I have a list of items and I want to combine those into other lists of a particular length. Duplication doesn't matter (so, not sets), although later I'll want to filter the lists on some utility function. That's not the interesting bit. <!--more-->

Create a list, and specify a length. Imagine a loop where the length gets bigger:

<pre class="brush:plain">
$ perl6
> my @n = &lt;1 2 3>;
[1 2 3]
> my $n = 4;
4
</pre>

Now for the fancy stuff. The <code>xx</code> replicates the list. It's not flat. I get a list that has that number of lists. Yep, Perl 6 has proper lists of lists. 

Then, I take that list of lists and reduce it with a cross operator. I end up with a bunch of lists of length <code>$n</code> in all the combinations:

<pre class="brush:plain">
> ( [X] ( @n xx $n ) )
((1 1 1 1) (1 1 1 2) (1 1 1 3) (1 1 2 1) (1 1 2 2) (1 1 2 3) 
(1 1 3 1) (1 1 3 2) (1 1 3 3) (1 2 1 1) (1 2 1 2) (1 2 1 3) 
(1 2 2 1) (1 2 2 2) (1 2 2 3) (1 2 3 1) (1 2 3 2) (1 2 3 3) 
(1 3 1 1) (1 3 1 2) (1 3 1 3) (1 3 2 1) (1 3 2 2) (1 3 2 3) 
(1 3 3 1) (1 3 3 2) (1 3 3 3) (2 1 1 1) (2 1 1 2) (2 1 1 3) 
(2 1 2 1) (2 1 2 2) (2 1 2 3) (2 1 3 1) (2 1 3 2) (2 1 3 3) 
(2 2 1 1) (2 2 1 2) (2 2 1 3) (2 2 2 1) (2 2 2 2) (2 2 2 3) 
(2 2 3 1) (2 2 3 2) (2 2 3 3) (2 3 1 1) (2 3 1 2) (2 3 1 3) 
(2 3 2 1) (2 3 2 2) (2 3 2 3) (2 3 3 1) (2 3 3 2) (2 3 3 3) 
(3 1 1 1) (3 1 1 2) (3 1 1 3) (3 1 2 1) (3 1 2 2) (3 1 2 3) 
(3 1 3 1) (3 1 3 2) (3 1 3 3) (3 2 1 1) (3 2 1 2) (3 2 1 3) 
(3 2 2 1) (3 2 2 2) (3 2 2 3) (3 2 3 1) (3 2 3 2) (3 2 3 3) 
(3 3 1 1) (3 3 1 2) (3 3 1 3) (3 3 2 1) (3 3 2 2) (3 3 2 3) 
(3 3 3 1) (3 3 3 2) (3 3 3 3))
</pre>

Note that permutations are different, and that's even easier because there's a method for that:

<pre class="brush:plain">
> @n.permutations
((1 2 3) (1 3 2) (2 1 3) (2 3 1) (3 1 2) (3 2 1))
</pre>

But, let's do it step by step.

First, I have a list:

<pre class="brush:plain">
> (1, 2, 3)
( 1 2 3 )
</pre>

Now, I want to replicate it. I can do that to get two lists in a bigger list:

<pre class="brush:plain">
> (1, 2, 3) xx 2
((1 2 3) (1 2 3))
</pre>

As a side note, if you don't like that, you could "de-containerize" (using <code>|</code>) the small list so it loses its structure:

<pre class="brush:plain">
> |(1, 2, 3) xx 2
(1 2 3 1 2 3)
</pre>

I want to keep the structure, however, so I can combine two copies of the list. The next step is a cross. Here I do it by hand:

<pre class="brush:plain">
> (1, 2, 3) X ( 1, 2, 3 )
((1 1) (1 2) (1 3) (2 1) (2 2) (2 3) (3 1) (3 2) (3 3))
</pre>

That's not so bad. The cross makes little lists of the first element of the first list and all the elements of the second list in turn. Then with the second element, and so on. The big list is a bunch of two element little lists.

Now, do that as a reduction. With two lists, it's the same result:

<pre class="brush:plain">
> [X] (1, 2, 3), (1, 2, 3)
((1 1) (1 2) (1 3) (2 1) (2 2) (2 3) (3 1) (3 2) (3 3))
</pre>

But, try it with three lists. The lefthand cross gives the result I've already shown. There's one more cross to go. Take the first element, <code>(1, 1)</code> and combine it with <code>1</code> to get <code>(1, 1, 1)</code>. And, do all of those:

<pre class="brush:plain">
> (1, 2, 3) X ( 1, 2, 3 ) X ( 1, 2, 3 )
...
>  ((1, 1) ... (3, 3))    X ( 1, 2, 3 )
((1 1 1) (1 1 2) ... (3 3 2) (3 3 3))
</pre>

The reduction operator does that for me. It takes two elements, does the operation, and puts the result back on the list. Then it takes that element and the next element and does the operation again. It keeps doing that until there's one element. I can cross as many times as I like without repeatedly typing it. This is the same thing:

<pre class="brush:plain">
> [X] (1, 2, 3), ( 1, 2, 3 ), ( 1, 2, 3 )
...
</pre>

And, I already know how to replicate the list:

<pre class="brush:plain">
> [X] (1, 2, 3) xx 3
((1 1 1) (1 1 2) ... (3 3 2) (3 3 3))
</pre>

Now, I put that list in a variable and the count in another variable:

<pre class="brush:plain">
> [X] @n xx $n
( ... )
</pre>

The combinatorial explosion might wreck the computer, but that's why they make bigger computers. And, later, Perl 6 will let things happen in parallel.

But, I said that I wanted to apply a utility function to these. I can <code>grep</code> those:

<pre class="brush:plain">
> ( [X] @n xx 5 ).grep( { .sum > 13 } )
((2 3 3 3 3) (3 2 3 3 3) (3 3 2 3 3) (3 3 3 2 3) (3 3 3 3 2) (3 3 3 3 3))
</pre>

But, I can do better than that! Oh yeah, it gets better. I want to partition the big set. I can call <code>categorize</code>. The string I return is which hash key the item "belongs" to. I get a hash back, and each key has an array with the values associated with that key:

<pre class="brush:plain">
> ( [X] @n xx 5 ).categorize( { .sum > 13 ?? 'pass' !! 'fail' } )
{fail => [(1 1 1 1 1) ... (3 3 3 3 1)], pass => [(2 3 3 3 3) (3 2 3 3 3) (3 3 2 3 3) (3 3 3 2 3) (3 3 3 3 2) (3 3 3 3 3)]}
</pre>

This sort of thing replaces several Perl 5 modules I've written where I had to manage arrays of arrays to build tuples.
