<!--
title: Quick Tip #25: Very literal Quoting
link: http://www.learningraku.com/2016/12/10/quick-tip-25-very-literal-quoting/
author: brian
post_id: 229
date: 2016-12-10 09:02:04
post_name: quick-tip-25-very-literal-quoting
status: publish
type: post
categories: kickstarter-tips strings
tags: 
-->


Perl 6 has a basic <a href="https://docs.perl6.org/language/quoting">quoting mechanism</a> that is as literal as it can be. It doesn't escape anything and doesn't interpolate anything. The <code>Q</code> does nothing special so you get a string as close to exactly what you see: <!--more-->

<pre class="brush:plain">
$ perl6
> Q/Single quote delimiter with \/; # no escaping
Single quote delimiter with \
> Q/This is about $var./ # no interpolation
This is about $var.
> Q"This is still about $var." # still no interpolation
This is still about $var.
> Q"C:\\This\is\a\path" # no \ proliferation!
C:\\This\is\a\path
</pre>

It does have on interesting feature. It knows how to count balanced delimiters. If I use one of the paired characters, I can have the opening version in the literal string as long as the open and closing bits are balanced (so, every opener has a closer):

<pre class="brush:plain">
> Q&lt; I have some &lt;&lt; inside >> >
 I have some &lt;&lt; inside >>
</pre>

If I don't have balanced thingys, I have a problem:

<pre class="brush:plain">
> Q&lt; I have some &lt;&lt; inside  >
===SORRY!=== Error while compiling:
Couldn't find terminator > (corresponding &lt; was at line 1)
at line 2
------> &lt;BOL>⏏&lt;I EOL>
    expecting any of:
        >
</pre>

I wouldn't recommend this, though, because I can choose many other delimiters:

<pre class="brush:plain">
> Q&#x1f431;I have some >> inside&#x1f431;
I have some >> inside
</pre>

I can't use anything I like as a delimiter, though, and some of the exclusions may surprise you:

<table>
<tr>
	<th>Prohibited</th>
	<th>Reason</th>
</tr>

<tr>
	<td><code>#</code></td>
	<td>start of a comment</td>
</tr>
<tr>
	<td><code>(</code></td>
	<td>Looks like a function call</td>
</tr>
<tr>
	<td><code>:</code></td>
	<td>Starts an adverb</td>
</tr>
<tr>
	<td><code>'</code></td>
	<td>Identifier character</td>
</tr>
<tr>
	<td><code>-</code></td>
	<td>Identifier character</td>
</tr>
<tr>
	<td>word characters</td>
	<td>Because that's crazy</td>
</tr>
</table>

The rest of the quoting mechanisms build up from there. Other quoting forms have their own operators, such as <code>q//</code> for single quoting with limited escaping and qq// for double quoting with interpolation. The <Code>Q</code> can handle them will an adverb:

<pre class="brush:plain">
q/This has a backslash \n/
Q:q//This has a backslash \n/
qq/This and a newline \n/
Q:qq/This and a newline \n/
</pre>

